SELECT  Місто, AVG(Рейтинг) as Рейтинг from СТО
GROUP BY СТО.Місто
HAVING AVG(Рейтинг)<5;

SELECT  MAX(Вартість*[Кількість деталей]) as Максимальна_ватість from Замовлення,Деталь
WHERE  Замовлення.[Код деталі]=Деталь.[Код деталі];

SELECT Деталь.Назва, SUM([Кількість деталей])as Кількість from Замовлення
INNER  JOIN Деталь  on Деталь.[Код деталі]=Замовлення.[Код деталі]
GROUP BY Деталь.Назва;

SELECT  YEAR(getdate())- AVG(DISTINCT Рік) as Середній_Вік_Автомобіля from Автомобіль;

SELECT  STDEV ( Потужність) as Середнє_квадратичне_відхилення_потужності  from Автомобіль;
