USE Ремонт_автомобілів;

SELECT [Клієнт].[Прізвище],[Клієнт].[Ім’я],[Клієнт].[По батькові],[Клієнт].[Місто],
[Клієнт].[Вулиця],[Клієнт].[Будинок],[Замовлення].[Код замовлення],[Замовлення].[Код клієнта],
[Замовлення].[Код автомобіля],[Замовлення].[Код працівника],[Замовлення].[Код СТО],
[Замовлення].[Код деталі],[Замовлення].[Кількість деталей],[Замовлення].[Дата замовлення],[Деталь].[Назва],[Деталь].[Вартість]
FROM (Клієнт INNER JOIN Замовлення ON Замовлення.[Код клієнта]=Клієнт.[Код клієнта])
INNER JOIN Деталь ON Деталь.[Код деталі]=Замовлення.[Код деталі]
WHERE Вулиця = ANY (SELECT Вулиця FROM СТО )
AND Місто LIKE N'Л%' 
AND  MONTH([Дата замовлення]) BETWEEN 1 AND 5;

SELECT * 
FROM (Клієнт LEFT JOIN Замовлення ON Замовлення.[Код клієнта]=Клієнт.[Код клієнта])
WHERE [Код замовлення] IS NOT NULL 
AND EXISTS (SELECT СТО.[Код СТО] FROM СТО WHERE СТО.Місто=Клієнт.Місто );

SELECT * 
FROM Автомобіль
WHERE [Тип кузова] IN (N'Седан',N'Універсал') 
AND [Тип двигуна] = 
ALL (SELECT [Тип двигуна] FROM Автомобіль WHERE Потужність BETWEEN  115 AND 152);
