SELECT *
  FROM [Ремонт_автомобілів].[dbo].[СТО]

SELECT *
  FROM [Ремонт_автомобілів].[dbo].[Замовлення]

SELECT *
  FROM [Ремонт_автомобілів].[dbo].[Автомобіль]

CREATE VIEW СТО_1 AS SELECT DISTINCT [Код СТО],Назва,Сайт,Телефон,Пошта,Рейтинг
FROM СТО;

SELECT *
  FROM [Ремонт_автомобілів].[dbo].[СТО_1]

SELECT *
  FROM [Ремонт_автомобілів].[dbo].[СТО_1]
  WHERE Рейтинг > 3

SELECT * FROM Замовлення
INNER JOIN Автомобіль ON Автомобіль.[Код автомобіля]=Замовлення.[Код автомобіля];

SELECT * FROM Замовлення,Автомобіль
WHERE Замовлення.[Код автомобіля]=Автомобіль.[Код автомобіля] AND YEAR(Замовлення.[Дата замовлення])>2019